Revit 2027 API
IPipeFittingAndAccessoryPressureDropUIServer.ShowSettings Method
 Shows the settings UI.
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool ShowSettings(
	PipeFittingAndAccessoryPressureDropUIData data
)
Function ShowSettings (
	data As PipeFittingAndAccessoryPressureDropUIData
) As Boolean
bool ShowSettings(
	PipeFittingAndAccessoryPressureDropUIData^ data
)
abstract ShowSettings :
        data : PipeFittingAndAccessoryPressureDropUIData -> bool
Parameters
data PipeFittingAndAccessoryPressureDropUIData
 The input data of the calculation.
Return Value
Boolean
 True if the user makes any changes in the UI, false otherwise.
See Also
Reference
IPipeFittingAndAccessoryPressureDropUIServer Interface
Autodesk.Revit.UI.Plumbing Namespace